Revit 2025 API
BuiltInCategory Enumeration
 A list of all the built in categories within Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BuiltInCategory
Public Enumeration BuiltInCategory
public enum class BuiltInCategory
type BuiltInCategory
Members
Member name | Value | Description
INVALID | -1
OST_MatchAll | -2,000,002
OST_MatchModel | -2,000,003
OST_MatchAnnotation | -2,000,004
OST_MatchDetail | -2,000,005
OST_MatchProfile | -2,000,006
OST_MatchSiteComponent | -2,000,007
OST_ScheduleViewParamGroup | -2,000,008
OST_IOSRegenerationFailure | -2,000,010
OST_Walls | -2,000,011
OST_WallsCutOutlines | -2,000,012
OST_WallsProjectionOutlines | -2,000,013
OST_Windows | -2,000,014
OST_WindowsGlassCut | -2,000,015
OST_WindowsGlassProjection | -2,000,016
OST_WindowsFrameMullionCut | -2,000,017
OST_WindowsFrameMullionProjection | -2,000,018
OST_WindowsSillHeadCut | -2,000,019
OST_WindowsSillHeadProjection | -2,000,020
OST_WindowsOpeningCut | -2,000,021
OST_WindowsOpeningProjection | -2,000,022
OST_Doors | -2,000,023
OST_DoorsPanelCut | -2,000,024
OST_DoorsPanelProjection | -2,000,025
OST_DoorsOpeningCut | -2,000,026
OST_DoorsOpeningProjection | -2,000,027
OST_DoorsFrameMullionCut | -2,000,028
OST_DoorsFrameMullionProjection | -2,000,029
OST_DoorsGlassCut | -2,000,030
OST_DoorsGlassProjection | -2,000,031
OST_Floors | -2,000,032
OST_FloorsCut | -2,000,033
OST_FloorsProjection | -2,000,034
OST_Roofs | -2,000,035
OST_RoofsCut | -2,000,036
OST_RoofsProjection | -2,000,037
OST_Ceilings | -2,000,038
OST_CeilingsCut | -2,000,039
OST_CeilingsProjection | -2,000,040
OST_Curves | -2,000,041
OST_CurvesThinLines | -2,000,042
OST_CurvesMediumLines | -2,000,043
OST_CurvesWideLines | -2,000,044
OST_SketchLines | -2,000,045
OST_IOSRegeneratedElements | -2,000,046
OST_IOSBackedUpElements | -2,000,047
OST_IOSAligningLine | -2,000,048
OST_IOSAlignmentGraphics | -2,000,049
OST_IOSConstructionLine | -2,000,050
OST_Lines | -2,000,051
OST_IOSDatumPlane | -2,000,052
OST_IOSFreeSnapLine | -2,000,053
OST_IOSSuspendedSketch_obsolete | -2,000,054
OST_IOSSketchGrid | -2,000,055
OST_IOSFlipControl | -2,000,056
OST_IOSThinPixel | -2,000,057
OST_CutOutlines | -2,000,058
OST_IOS | -2,000,059
OST_Extrusions | -2,000,060
OST_IOSThinPixel_Dot | -2,000,061
OST_IOSThinPixel_Dash | -2,000,062
OST_IOSThinPixel_DashDot | -2,000,063
OST_InvisibleLines | -2,000,064
OST_AxisOfRotation | -2,000,065
OST_RoomSeparationLines | -2,000,066
OST_StairsSketchBoundaryLines | -2,000,067
OST_StairsSketchRiserLines | -2,000,068
OST_StairsSketchRunLines | -2,000,069
OST_StairsSketchLandingCenterLines | -2,000,070
OST_IOSGhost | -2,000,071
OST_IOSGroups | -2,000,072
OST_IOSCrashGraphics | -2,000,073
OST_IOSCuttingGeometry | -2,000,074
OST_IOSRoomPerimeterLines | -2,000,075
OST_CloudLines | -2,000,076
OST_InsulationLines | -2,000,077
OST_GenericLines | -2,000,078
OST_AreaSchemeLines | -2,000,079
OST_Furniture | -2,000,080
OST_FillPatterns | -2,000,081
OST_IOSNotSilhouette | -2,000,082
OST_ReferenceLines | -2,000,083
OST_IOSSlabShapeEditorExplitCrease | -2,000,084
OST_IOSSlabShapeEditorAutoCrease | -2,000,085
OST_IOSSlabShapeEditorBoundary | -2,000,086
OST_IOSSlabShapeEditorPointBoundary | -2,000,087
OST_IOSSlabShapeEditorPointInterior | -2,000,088
OST_IOSBBoxScreenSize | -2,000,089
OST_Curtain_Systems | -2,000,090
OST_IOSArrays | -2,000,091
OST_IOSMeasureLine | -2,000,092
OST_IOSWallCoreBoundary | -2,000,093
OST_IOSSuspendedSketch | -2,000,094
OST_IOSModelGroups | -2,000,095
OST_IOSDetailGroups | -2,000,096
OST_IOSAttachedDetailGroups | -2,000,097
OST_IOSRoomTagToRoomLines | -2,000,098
OST_IOSRebarSystemSpanSymbolCtrl | -2,000,099
OST_Columns | -2,000,100
OST_IOSMeasureLineScreenSize | -2,000,101
OST_EPS_Existing | -2,000,102
OST_EPS_Demolished | -2,000,103
OST_EPS_New | -2,000,104
OST_EPS_Temporary | -2,000,105
OST_EPS_Future | -2,000,106
OST_GuideGrid | -2,000,107
OST_IOSFabricReinSpanSymbolCtrl | -2,000,109
OST_IOS_GeoLocations | -2,000,110
OST_IOS_GeoSite | -2,000,111
OST_Phases | -2,000,112
OST_IOSDragBox | -2,000,113
OST_IOSDragBoxInverted | -2,000,114
OST_IOSRoomUpperLowerLines | -2,000,115
OST_IOSRoomComputationHeight | -2,000,116
OST_IOSNavWheelPivotBall | -2,000,117
OST_Stairs | -2,000,120
OST_StairsIncomplete_Deprecated | -2,000,121
OST_StairsAboveCut_ToBeDeprecated | -2,000,122
OST_StairsStringerCarriage | -2,000,123
OST_StairsSupportsAboveCut | -2,000,124
OST_StairsUpText | -2,000,125
OST_StairsRailing | -2,000,126
OST_StairsRailingBaluster | -2,000,127
OST_StairsRailingRail | -2,000,128
OST_StairsDownText | -2,000,129
OST_StairsUpArrows | -2,000,130
OST_StairsDownArrows | -2,000,131
OST_StairsRailingAboveCut | -2,000,132
OST_StairsRailingTags | -2,000,133
OST_Fixtures | -2,000,140
OST_GenericAnnotation | -2,000,150
OST_GenericModel | -2,000,151
OST_Rooms | -2,000,160
OST_RoomInteriorFillVisibility | -2,000,161
OST_RoomReferenceVisibility | -2,000,162
OST_AreaInteriorFillVisibility | -2,000,163
OST_AreaReferenceVisibility | -2,000,164
OST_AreaColorFill | -2,000,165
OST_RoomInteriorFill | -2,000,166
OST_RoomReference | -2,000,167
OST_AreaInteriorFill | -2,000,168
OST_AreaReference | -2,000,169
OST_CurtainWallPanels | -2,000,170
OST_CurtainWallMullions | -2,000,171
OST_CurtainWallMullionsCut | -2,000,172
OST_CurtainGrids | -2,000,173
OST_Railings | -2,000,175
OST_RailingBalusterRail | -2,000,176
OST_RailingBalusterRailCut | -2,000,177
OST_Ramps | -2,000,180
OST_Cornices | -2,000,181
OST_Reveals | -2,000,182
OST_Massing | -2,000,185
OST_MassingCutOutlines | -2,000,186
OST_MassingProjectionOutlines | -2,000,187
OST_FilledRegion | -2,000,190
OST_PlanRegion | -2,000,191
OST_FaceSplitter | -2,000,192
OST_Matchline | -2,000,193
OST_MaskingRegion | -2,000,194
OST_ModelText | -2,000,195
OST_ImportObjectStyles | -2,000,196
OST_ReferenceViewerSymbol | -2,000,197
OST_ReferenceViewer | -2,000,198
OST_Sections | -2,000,200
OST_SectionLine | -2,000,201
OST_BrokenSectionLine | -2,000,202
OST_Grids | -2,000,220
OST_GridChains | -2,000,221
OST_DisplacementElements | -2,000,222
OST_DisplacementPath | -2,000,223
OST_Levels | -2,000,240
OST_Dimensions | -2,000,260
OST_WeakDims | -2,000,261
OST_Constraints | -2,000,262
OST_SpotElevations | -2,000,263
OST_SpotCoordinates | -2,000,264
OST_SpotSlopes | -2,000,265
OST_RoofTags | -2,000,266
OST_Assemblies | -2,000,267
OST_AssemblyTags | -2,000,268
OST_Parts | -2,000,269
OST_PartTags | -2,000,270
OST_PartHiddenLines | -2,000,271
OST_Viewers | -2,000,278
OST_Views | -2,000,279
OST_TitleBlocks | -2,000,280
OST_TitleBlockThinLines | -2,000,281
OST_TitleBlockMediumLines | -2,000,282
OST_TitleBlockWideLines | -2,000,283
OST_OverheadLines | -2,000,284
OST_DemolishedLines | -2,000,285
OST_HiddenLines | -2,000,286
OST_LinesBeyond | -2,000,287
OST_CenterLines | -2,000,288
OST_DirectionEdgeLines | -2,000,289
OST_Catalogs | -2,000,290
OST_Divisions | -2,000,291
OST_TextNotes | -2,000,300
OST_SectionBox | -2,000,301
OST_RenderRegions | -2,000,302
OST_AnalysisResults | -2,000,303
OST_AnalysisDisplayStyle | -2,000,304
OST_HostFin | -2,000,310
OST_HostFinFloor | -2,000,311
OST_HostFinRoof | -2,000,312
OST_HostFinCeiling | -2,000,313
OST_HostFinWall | -2,000,314
OST_HostFinHF | -2,000,315
OST_CurtainGridsRoof | -2,000,320
OST_CurtainGridsWall | -2,000,321
OST_CurtainGridsSystem | -2,000,322
OST_CurtainGridsCurtaSystem | -2,000,323
OST_AreaReport_Triangle | -2,000,325
OST_AreaReport_Boundary | -2,000,326
OST_AreaReport_Arc_Plus | -2,000,327
OST_AreaReport_Arc_Minus | -2,000,328
OST_CurtaSystem | -2,000,340
OST_CurtaSystemFaceManager | -2,000,341
OST_ContourLabels | -2,000,350
OST_SectionHeads | -2,000,400
OST_SectionHeadThinLines | -2,000,401
OST_SectionHeadMediumLines | -2,000,403
OST_SectionHeadWideLines | -2,000,404
OST_WindowTags | -2,000,450
OST_DoorTags | -2,000,460
OST_RoomTags | -2,000,480
OST_MEPSpaceTags | -2,000,485
OST_Cameras | -2,000,500
OST_Camera_Lines | -2,000,501
OST_Viewports | -2,000,510
OST_ViewportLabel | -2,000,515
OST_Lights | -2,000,520
OST_CLines | -2,000,530
OST_AxisX | -2,000,531
OST_AxisY | -2,000,532
OST_AxisZ | -2,000,533
OST_Elev | -2,000,535
OST_CropBoundary | -2,000,536
OST_Callouts | -2,000,537
OST_CalloutHeads | -2,000,538
OST_CalloutBoundary | -2,000,539
OST_WallsSurfacePattern | -2,000,540
OST_FloorsSurfacePattern | -2,000,541
OST_RoofsSurfacePattern | -2,000,542
OST_CeilingsSurfacePattern | -2,000,543
OST_CalloutLeaderLine | -2,000,544
OST_WallsAnalyticalGeometry | -2,000,545
OST_FloorsAnalyticalGeometry | -2,000,546
OST_AnnotationCrop | -2,000,547
OST_CropBoundarySpecial | -2,000,548
OST_AnnotationCropSpecial | -2,000,549
OST_ColorFillLegends | -2,000,550
OST_RoomColorFill | -2,000,551
OST_ColorFillSchema | -2,000,552
OST_RasterImages | -2,000,560
OST_ScheduleGraphics | -2,000,570
OST_Schedules | -2,000,573
OST_LegendComponents | -2,000,575
OST_PreviewLegendComponents | -2,000,576
OST_WallsMembrane | -2,000,580
OST_WallsStructure | -2,000,581
OST_WallsInsulation | -2,000,582
OST_WallsSubstrate | -2,000,583
OST_WallsFinish1 | -2,000,584
OST_WallsFinish2 | -2,000,585
OST_WallsDefault | -2,000,586
OST_HiddenWallLines | -2,000,587
OST_WallsCutPattern | -2,000,588
OST_RoofsMembrane | -2,000,590
OST_RoofsStructure | -2,000,591
OST_RoofsInsulation | -2,000,592
OST_RoofsSubstrate | -2,000,593
OST_RoofsFinish1 | -2,000,594
OST_RoofsFinish2 | -2,000,595
OST_RoofsDefault | -2,000,596
OST_RoofsCutPattern | -2,000,597
OST_RoofsInteriorEdges | -2,000,598
OST_FloorsMembrane | -2,000,600
OST_FloorsStructure | -2,000,601
OST_FloorsInsulation | -2,000,602
OST_FloorsSubstrate | -2,000,603
OST_FloorsFinish1 | -2,000,604
OST_FloorsFinish2 | -2,000,605
OST_FloorsDefault | -2,000,606
OST_HiddenFloorLines | -2,000,607
OST_FloorsCutPattern | -2,000,608
OST_FloorsInteriorEdges | -2,000,609
OST_CeilingsMembrane | -2,000,610
OST_CeilingsStructure | -2,000,611
OST_CeilingsInsulation | -2,000,612
OST_CeilingsSubstrate | -2,000,613
OST_CeilingsFinish1 | -2,000,614
OST_CeilingsFinish2 | -2,000,615
OST_CeilingsDefault | -2,000,616
OST_CeilingsCutPattern | -2,000,617
OST_Materials | -2,000,700
OST_ReferencePoints | -2,000,710
OST_ReferencePoints_Points | -2,000,711
OST_ReferencePoints_Planes | -2,000,712
OST_ReferencePoints_Lines | -2,000,713
OST_ReferencePoints_HiddenLines | -2,000,714
OST_XRayProfileEdge | -2,000,715
OST_XRaySideEdge | -2,000,716
OST_XRayPathCurve | -2,000,717
OST_XRayPathPoint | -2,000,718
OST_XRayImplicitPathCurve | -2,000,719
OST_XRayConstrainedProfileEdge | -2,000,720
OST_ControlAxisX | -2,000,721
OST_ControlAxisY | -2,000,772
OST_ControlAxisZ | -2,000,773
OST_ControlLocal | -2,000,774
OST_IOSTilePatternGrid | -2,000,800
OST_IOSOpening | -2,000,810
OST_RemovedGridSeg | -2,000,827
OST_InstanceDrivenLineStyle | -2,000,828
OST_RoomPolylines | -2,000,829
OST_AreaPolylines | -2,000,830
OST_MEPSpaceSeparationLines | -2,000,831
OST_DimLockControlLeader | -2,000,832
OST_PathOfTravelLines | -2,000,833
OST_PathOfTravelTags | -2,000,834
OST_StructLocationLineControl | -2,000,880
OST_WallRefPlanes | -2,000,896
OST_RoofOpening | -2,000,897
OST_FloorOpening | -2,000,898
OST_CeilingOpening | -2,000,899
OST_AdaptivePoints | -2,000,900
OST_AdaptivePoints_Points | -2,000,901
OST_AdaptivePoints_Planes | -2,000,902
OST_AdaptivePoints_Lines | -2,000,903
OST_AdaptivePoints_HiddenLines | -2,000,904
OST_RailingSystem | -2,000,905
OST_RailingSystemSegment | -2,000,906
OST_RailingSystemPost | -2,000,907
OST_RailingSystemBaluster | -2,000,908
OST_RailingSystemPanel | -2,000,909
OST_RailingSystemHardware | -2,000,910
OST_RailingSystemHandRail | -2,000,911
OST_RailingSystemHandRailBracket | -2,000,912
OST_RailingSystemTopRail | -2,000,913
OST_RailingSystemRail | -2,000,914
OST_RailingSystemTermination | -2,000,915
OST_RailingSystemTransition | -2,000,916
OST_RailingSystemTags | -2,000,917
OST_Stair2012_Deprecated | -2,000,918
OST_StairsRuns | -2,000,919
OST_StairsLandings | -2,000,920
OST_StairsTrisers | -2,000,921
OST_StairStringer2012_Deprecated | -2,000,922
OST_AppearanceAsset | -2,000,923
OST_PropertySet | -2,000,924
OST_IOSRoomCalculationPoint | -2,000,925
OST_DividedPath | -2,000,926
OST_ComponentRepeater | -2,000,927
OST_ComponentRepeaterSlot | -2,000,928
OST_StairsCutMarks | -2,000,930
OST_StairsCutMarksAboveCut | -2,000,931
OST_StairsNosingLines | -2,000,932
OST_StairsNosingLinesAboveCut | -2,000,933
OST_StairsOutlines | -2,000,934
OST_StairsOutlinesAboveCut | -2,000,935
OST_StairsRiserLines | -2,000,936
OST_StairsRiserLinesAboveCut | -2,000,937
OST_StairsPaths | -2,000,938
OST_StairsPathsAboveCut | -2,000,939
OST_StairsRunTags | -2,000,940
OST_StairsLandingTags | -2,000,941
OST_StairsSupportTags | -2,000,942
OST_StairsTriserTags | -2,000,943
OST_StairsTriserNumbers | -2,000,944
OST_StairsSketchPathLines | -2,000,945
OST_RailingTopRail | -2,000,946
OST_RailingHandRail | -2,000,947
OST_RailingSupport | -2,000,948
OST_RailingTermination | -2,000,949
OST_RailingTopRailAboveCut | -2,000,950
OST_RailingHandRailAboveCut | -2,000,951
OST_StairsSupports | -2,000,952
OST_RailingRailPathLines | -2,000,953
OST_RailingRailPathExtensionLines | -2,000,954
OST_LinkAnalyticalTags | -2,000,955
OST_NodeAnalyticalTags | -2,000,956
OST_AnalyticalPanelTags | -2,000,957
OST_AnalyticalOpeningTags | -2,000,958
OST_DSR_LineAndTextAttrCategoryId | -2,000,960
OST_DSR_LineAndTextAttrFontId | -2,000,961
OST_DSR_DimStyleTickCategoryId | -2,000,962
OST_DSR_DimStyleHeavyEndCatId | -2,000,963
OST_DSR_DimStyleHeavyEndCategoryId | -2,000,964
OST_DSR_CenterlinePatternCatId | -2,000,965
OST_DSR_CenterlineTickMarkStyleId | -2,000,966
OST_DSR_ArrowHeadStyleId | -2,000,967
OST_DSR_InteriorTickMarkStyleId | -2,000,968
OST_DSR_LeaderTickMarkStyleId | -2,000,969
OST_MultiReferenceAnnotations | -2,000,970
OST_BeamLocalCoordSys | -2,000,971
OST_ColumnLocalCoordSys | -2,000,972
OST_BraceLocalCoordSys | -2,000,973
OST_WallLocalCoordSys | -2,000,974
OST_FloorLocalCoordSys | -2,000,975
OST_FndSlabLocalCoordSys | -2,000,976
OST_CoordinateSystem | -2,000,977
OST_StructuralConnectionHandler_Deprecated | -2,000,978
OST_HiddenStructuralConnectionLines_Deprecated | -2,000,979
OST_MultistoryStairs | -2,000,980
OST_Coordination_Model | -2,000,982
OST_AnalyticalPipeConnections | -2,000,983
OST_AnalyticalPipeConnectionLineSymbol | -2,000,984
OST_MechanicalEquipmentSet | -2,000,985
OST_MechanicalEquipmentSetTags | -2,000,986
OST_MechanicalEquipmentSetBoundaryLines | -2,000,987
OST_PipeHydronicSeparationSymbols | -2,000,988
OST_RiseDropSymbols | -2,000,989
OST_ColumnOpening | -2,000,994
OST_StructuralFramingOpening | -2,000,995
OST_ShaftOpening | -2,000,996
OST_SWallRectOpening | -2,000,997
OST_DormerOpeningIncomplete | -2,000,998
OST_ArcWallRectOpening | -2,000,999
OST_Casework | -2,001,000
OST_MEPSystemZone | -2,001,001
OST_MEPSystemZoneBoundary | -2,001,002
OST_MEPSystemZoneInteriorFill | -2,001,003
OST_MEPSystemZoneReferenceLines | -2,001,004
OST_MEPSystemZoneInteriorFillVisibility | -2,001,005
OST_MEPSystemZoneReferenceLinesVisibility | -2,001,006
OST_MEPSystemZoneTags | -2,001,007
OST_MEPAnalyticalAirLoop | -2,001,008
OST_MEPAnalyticalWaterLoop | -2,001,009
OST_ZoneEquipment | -2,001,010
OST_ElectricalCircuitNaming | -2,001,011
OST_Alignments | -2,001,012
OST_MajorStations_Deprecated | -2,001,013
OST_MinorStations_Deprecated | -2,001,014
OST_AlignmentsTags | -2,001,015
OST_AlignmentStationLabelSets | -2,001,016
OST_AlignmentStationLabels | -2,001,017
OST_ElectricalZoneEquipment_Obsolete | -2,001,018
OST_ElectricalLoadZoneType | -2,001,019
OST_ElectricalLoadZoneInstance | -2,001,020
OST_MEPAnalyticalBus | -2,001,021
OST_OBSOLETE_MEPAnalyticalElectricalBranch | -2,001,022
OST_MEPAnalyticalTransferSwitch | -2,001,023
OST_MEPLoadAreas | -2,001,024
OST_MEPLoadAreaTags_OBSOLETE | -2,001,025
OST_ElectricalPowerSource | -2,001,026
OST_MEPLoadAreaColorFill | -2,001,027
OST_MEPLoadAreaInteriorFill | -2,001,028
OST_MEPLoadAreaReference | -2,001,029
OST_MEPLoadAreaInteriorFillVisibility | -2,001,030
OST_MEPLoadAreaReferenceVisibility | -2,001,031
OST_MEPLoadAreaSeparationLines | -2,001,033
OST_WallNonCoreLayer | -2,001,034
OST_WallCoreLayer | -2,001,035
OST_Hardscape | -2,001,036
OST_HardscapeHiddenLines | -2,001,037
OST_HardscapeTags | -2,001,038
OST_TemporaryStructure | -2,001,039
OST_ElectricalEquipment | -2,001,040
OST_TemporaryStructureHiddenLines | -2,001,041
OST_TemporaryStructureTags | -2,001,042
OST_FoodServiceEquipment | -2,001,043
OST_FoodServiceEquipmentHiddenLines | -2,001,044
OST_FoodServiceEquipmentTags | -2,001,045
OST_MedicalEquipment | -2,001,046
OST_MedicalEquipmentHiddenLines | -2,001,047
OST_MedicalEquipmentTags | -2,001,048
OST_FireProtection | -2,001,049
OST_FireProtectionHiddenLines | -2,001,050
OST_FireProtectionTags | -2,001,051
OST_VerticalCirculation | -2,001,052
OST_VerticalCirculationHiddenLines | -2,001,053
OST_VerticalCirculationTags | -2,001,054
OST_AudioVisualDevices | -2,001,055
OST_AudioVisualDevicesHiddenLines | -2,001,056
OST_AudioVisualDeviceTags | -2,001,057
OST_Signage | -2,001,058
OST_SignageHiddenLines | -2,001,059
OST_ElectricalFixtures | -2,001,060
OST_SignageTags | -2,001,061
OST_FasciaTags | -2,001,062
OST_ColumnTags | -2,001,063
OST_EntourageTags | -2,001,064
OST_GutterTags | -2,001,065
OST_HandrailTags | -2,001,066
OST_PadTags | -2,001,067
OST_RampTags | -2,001,068
OST_RoofSoffitTags | -2,001,069
OST_SlabEdgeTags | -2,001,070
OST_TopRailTags | -2,001,071
OST_WallSweepTags | -2,001,072
OST_ModelGroupTags | -2,001,073
OST_RvtLinksTags | -2,001,074
OST_AnalyticalMemberCrossSection | -2,001,075
OST_FloorsSplitLines | -2,001,076
OST_ElectricalAnalyticalTransformer | -2,001,077
OST_ELECTRICAL_AreaBasedLoads_Tags | -2,001,078
OST_Toposolid | -2,001,079
OST_ToposolidHiddenLines | -2,001,080
OST_ToposolidContours | -2,001,081
OST_ToposolidSecondaryContours | -2,001,082
OST_ToposolidFoldingLines | -2,001,083
OST_ToposolidSplitLines | -2,001,084
OST_ToposolidDefault | -2,001,085
OST_ToposolidCutPattern | -2,001,086
OST_ToposolidMembrane | -2,001,087
OST_ToposolidStructure | -2,001,088
OST_ToposolidSubstrate | -2,001,089
OST_ToposolidFinish1 | -2,001,090
OST_ToposolidFinish2 | -2,001,091
OST_ToposolidSurfacePattern | -2,001,092
OST_ToposolidInsulation | -2,001,093
OST_ToposolidTags | -2,001,094
OST_ToposolidOpening | -2,001,095
OST_ElectricalAnalyticalFeeder | -2,001,096
OST_ToposolidLink | -2,001,097
OST_ElectricalLoadSet | -2,001,098
OST_ElectricalLoadCase | -2,001,099
OST_FurnitureSystems | -2,001,100
OST_ElectricalConnector | -2,001,101
OST_ElectricalConnectorTags | -2,001,102
OST_ToposolidLinkTags | -2,001,103
OST_RebarBendingDetails | -2,001,104
OST_WallLayers | -2,001,105
OST_FloorLayers | -2,001,106
OST_DataExchanges | -2,001,107
OST_RebarSpliceLines | -2,001,108
OST_RebarSpliceType | -2,001,109
OST_PipeFlowDirectionSymbols_Obsolete | -2,001,110
OST_DuctFlowDirectionSymbols_Obsolete | -2,001,111
OST_SheetCollections | -2,001,112
OST_PipeAnalyticalSegments | -2,001,113
OST_PipeAnalyticalSegmentTags | -2,001,114
OST_DuctAnalyticalSegments | -2,001,115
OST_DuctAnalyticalSegmentTags | -2,001,116
OST_LightingFixtures | -2,001,120
OST_LightingFixtureSource | -2,001,121
OST_MechanicalEquipment | -2,001,140
OST_PlumbingFixtures | -2,001,160
OST_Parking | -2,001,180
OST_Property | -2,001,200
OST_Roads | -2,001,220
OST_RoadTags | -2,001,221
OST_Sewer | -2,001,240
OST_Site | -2,001,260
OST_SiteSurface | -2,001,261
OST_SitePoint | -2,001,262
OST_BuildingPad | -2,001,263
OST_SiteProperty | -2,001,265
OST_SitePointBoundary | -2,001,266
OST_SitePropertyTags | -2,001,267
OST_SitePropertyLineSegment | -2,001,268
OST_SitePropertyLineSegmentTags | -2,001,269
OST_SiteRegion | -2,001,270
OST_ProjectBasePoint | -2,001,271
OST_SharedBasePoint | -2,001,272
OST_BasePointAxisX | -2,001,273
OST_BasePointAxisY | -2,001,274
OST_BasePointAxisZ | -2,001,275
OST_LinkBasePoint | -2,001,276
OST_StructuralFoundation | -2,001,300
OST_HiddenStructuralFoundationLines | -2,001,302
OST_StructuralFraming | -2,001,320
OST_StructuralFramingOther | -2,001,321
OST_Girder | -2,001,322
OST_Joist | -2,001,323
OST_Purlin | -2,001,324
OST_HorizontalBracing | -2,001,325
OST_VerticalBracing | -2,001,326
OST_StructuralFramingSystem | -2,001,327
OST_KickerBracing | -2,001,328
OST_HiddenStructuralFramingLines | -2,001,329
OST_StructuralColumns | -2,001,330
OST_FramingAnalyticalGeometry | -2,001,331
OST_ColumnAnalyticalGeometry | -2,001,332
OST_AnalyticalRigidLinks | -2,001,333
OST_HiddenStructuralColumnLines | -2,001,334
OST_StructuralColumnStickSymbols | -2,001,335
OST_StructuralTruss | -2,001,336
OST_TopographyLink | -2,001,339
OST_Topography | -2,001,340
OST_TopographySurface | -2,001,341
OST_TopographyContours | -2,001,342
OST_SecondaryTopographyContours | -2,001,343
OST_ColumnAnalyticalRigidLinks | -2,001,344
OST_SpecialityEquipment | -2,001,350
OST_Automatic | -2,001,351
OST_RvtLinks | -2,001,352
OST_FootingAnalyticalGeometry | -2,001,353
OST_StructuralStiffener | -2,001,354
OST_StructuralStiffenerTags | -2,001,355
OST_StructuralFramingLocationLine | -2,001,356
OST_StructuralColumnLocationLine | -2,001,357
OST_StructuralStiffenerHiddenLines | -2,001,358
OST_Blocks | -2,001,359
OST_Planting | -2,001,360
OST_Entourage | -2,001,370
OST_Fascia | -2,001,390
OST_Gutter | -2,001,391
OST_EdgeSlab | -2,001,392
OST_RoofSoffit | -2,001,393
OST_DetailComponents | -2,002,000
OST_ProfileFamilies | -2,003,000
OST_Sheets | -2,003,100
OST_ProjectInformation | -2,003,101
OST_Areas | -2,003,200
OST_AreaSchemes | -2,003,201
OST_ZoneSchemes | -2,003,225
OST_TrussDummy | -2,003,300
OST_RampsIncomplete | -2,003,301
OST_RampsAboveCut | -2,003,302
OST_RampsStringer | -2,003,303
OST_RampsStringerAboveCut | -2,003,304
OST_RampsUpText | -2,003,305
OST_RampsDownText | -2,003,306
OST_RampsUpArrow | -2,003,307
OST_RampsDownArrow | -2,003,308
OST_RepeatingDetailLines | -2,003,321
OST_DividedSurface | -2,003,323
OST_DividedSurface_Nodes | -2,003,324
OST_DividedSurface_Gridlines | -2,003,325
OST_DividedSurface_PatternLines | -2,003,326
OST_DividedSurface_PatternFill | -2,003,327
OST_DividedSurface_PreDividedSurface | -2,003,328
OST_DividedSurface_TransparentFace | -2,003,329
OST_AlwaysExcludedInAllViews | -2,003,330
OST_TilePatterns | -2,003,331
OST_DividedSurfaceBelt | -2,003,332
OST_DividedSurface_DiscardedDivisionLines | -2,003,333
OST_Mass | -2,003,400
OST_MassFloor | -2,003,403
OST_MassForm | -2,003,404
OST_MassTags | -2,003,405
OST_ZoningEnvelope | -2,003,406
OST_MassCutter | -2,003,407
OST_MassFaceSplitter | -2,003,408
OST_HostTemplate | -2,003,409
OST_MassAreaFaceTags | -2,003,410
OST_MassZone | -2,003,411
OST_MassInteriorWall | -2,003,412
OST_MassExteriorWall | -2,003,413
OST_MassRoof | -2,003,414
OST_MassGlazing | -2,003,415
OST_MassSkylights | -2,003,416
OST_MassOpening | -2,003,417
OST_MassShade | -2,003,418
OST_MassSlab | -2,003,419
OST_MassExteriorWallUnderground | -2,003,420
OST_MassWallsAll | -2,003,421
OST_MassFloorsAll | -2,003,422
OST_MassGlazingAll | -2,003,423
OST_StackedWalls | -2,003,500
OST_MEPSpaces | -2,003,600
OST_MEPSpaceInteriorFillVisibility | -2,003,601
OST_MEPSpaceReferenceVisibility | -2,003,602
OST_MEPSpaceInteriorFill | -2,003,603
OST_MEPSpaceReference | -2,003,604
OST_MEPSpaceColorFill | -2,003,605
OST_Tags | -2,005,000
OST_CaseworkTags | -2,005,001
OST_CeilingTags | -2,005,002
OST_ElectricalEquipmentTags | -2,005,003
OST_ElectricalFixtureTags | -2,005,004
OST_FurnitureTags | -2,005,006
OST_FurnitureSystemTags | -2,005,007
OST_LightingFixtureTags | -2,005,008
OST_MechanicalEquipmentTags | -2,005,009
OST_PlumbingFixtureTags | -2,005,010
OST_WallTags | -2,005,011
OST_CurtainWallPanelTags | -2,005,012
OST_GenericModelTags | -2,005,013
OST_SpecialityEquipmentTags | -2,005,014
OST_StructuralFramingTags | -2,005,015
OST_SiteTags | -2,005,016
OST_ParkingTags | -2,005,017
OST_StructuralColumnTags | -2,005,018
OST_StructuralFoundationTags | -2,005,019
OST_AreaTags | -2,005,020
OST_PlantingTags | -2,005,021
OST_MultiCategoryTags | -2,005,022
OST_StairsTags | -2,005,023
OST_HostFinTags | -2,005,024
OST_CurtaSystemTags | -2,005,025
OST_FloorTags | -2,005,026
OST_MaterialTags | -2,005,027
OST_DetailComponentTags | -2,005,028
OST_KeynoteTags | -2,005,029
OST_TrussTags | -2,005,030
OST_StructuralConnectionHandlerTags_Deprecated | -2,005,031
OST_CurtainWallMullionTags | -2,005,032
OST_MultiLeaderTag | -2,005,033
OST_SpotElevSymbols | -2,005,100
OST_SpotCoordinateSymbols | -2,005,101
OST_SpotSlopesSymbols | -2,005,102
OST_SpanDirectionSymbol | -2,005,110
OST_FootingSpanDirectionSymbol | -2,005,111
OST_BeamSystemTags | -2,005,130
OST_Loads | -2,005,200
OST_PointLoads | -2,005,201
OST_LineLoads | -2,005,202
OST_AreaLoads | -2,005,203
OST_InternalLoads | -2,005,204
OST_InternalPointLoads | -2,005,205
OST_InternalLineLoads | -2,005,206
OST_InternalAreaLoads | -2,005,207
OST_LoadCases | -2,005,210
OST_LoadCasesDead | -2,005,211
OST_LoadCasesLive | -2,005,212
OST_LoadCasesWind | -2,005,213
OST_LoadCasesSnow | -2,005,214
OST_LoadCasesRoofLive | -2,005,215
OST_LoadCasesAccidental | -2,005,216
OST_LoadCasesTemperature | -2,005,217
OST_LoadCasesSeismic | -2,005,218
OST_PointLoadTags | -2,005,250
OST_LineLoadTags | -2,005,251
OST_AreaLoadTags | -2,005,252
OST_InternalPointLoadTags | -2,005,253
OST_InternalLineLoadTags | -2,005,254
OST_InternalAreaLoadTags | -2,005,255
OST_BoundaryConditions | -2,005,301
OST_VolumeOfInterest | -2,006,000
OST_DecalElement | -2,006,001
OST_DecalType | -2,006,002
OST_LevelHeads | -2,006,020
OST_GridHeads | -2,006,040
OST_ElevationMarks | -2,006,045
OST_EditCutProfile | -2,006,050
OST_RevisionClouds | -2,006,060
OST_Revisions | -2,006,070
OST_RevisionNumberingSequences | -2,006,071
OST_RevisionCloudTags | -2,006,080
OST_StructuralAnnotations | -2,006,090
OST_StructConnectionSymbols | -2,006,100
OST_StructuralBracePlanReps | -2,006,110
OST_DesignOptionSets | -2,006,112
OST_DesignOptions | -2,006,114
OST_BridgeAbutments | -2,006,130
OST_BridgePiers | -2,006,131
OST_BridgeTowers | -2,006,132
OST_BridgeCables | -2,006,133
OST_BridgeArches | -2,006,134
OST_BridgeDecks | -2,006,135
OST_BridgeFoundations | -2,006,136
OST_BridgeGirders | -2,006,137
OST_BridgeBearings | -2,006,138
OST_BridgeAbutmentHiddenLines | -2,006,150
OST_BridgePierHiddenLines | -2,006,151
OST_BridgeTowerHiddenLines2021_Deprecated | -2,006,152
OST_BridgeCableHiddenLines2021_Deprecated | -2,006,153
OST_BridgeArchHiddenLines2021_Deprecated | -2,006,154
OST_BridgeDeckHiddenLines | -2,006,155
OST_BridgeFoundationHiddenLines2021_Deprecated | -2,006,156
OST_BridgeGirderHiddenLines2021_Deprecated | -2,006,157
OST_BridgeBearingHiddenLines | -2,006,158
OST_BridgeAbutmentTags | -2,006,170
OST_BridgePierTags | -2,006,171
OST_BridgeTowerTags | -2,006,172
OST_BridgeCableTags | -2,006,173
OST_BridgeArchTags | -2,006,174
OST_BridgeDeckTags | -2,006,175
OST_BridgeFoundationTags | -2,006,176
OST_BridgeGirderTags | -2,006,177
OST_BridgeBearingTags | -2,006,178
OST_AbutmentFoundations | -2,006,202
OST_AbutmentPiles | -2,006,203
OST_AbutmentWalls | -2,006,204
OST_ApproachSlabs | -2,006,205
OST_AbutmentFoundationTags | -2,006,208
OST_AbutmentPileTags | -2,006,209
OST_AbutmentWallTags | -2,006,210
OST_ApproachSlabTags | -2,006,211
OST_PierCaps | -2,006,219
OST_PierCapTags | -2,006,220
OST_PierColumns | -2,006,221
OST_PierColumnTags | -2,006,222
OST_PierPiles | -2,006,225
OST_PierPileTags | -2,006,226
OST_PierWalls | -2,006,229
OST_PierWallTags | -2,006,230
OST_BridgeFraming | -2,006,241
OST_BridgeFramingHiddenLines | -2,006,242
OST_BridgeFramingTags | -2,006,243
OST_BridgeFramingCrossBracing | -2,006,245
OST_BridgeFramingDiaphragms | -2,006,246
OST_BridgeFramingTrusses | -2,006,248
OST_VibrationManagement | -2,006,261
OST_VibrationManagementHiddenLines | -2,006,262
OST_VibrationDampers | -2,006,263
OST_VibrationDamperTags | -2,006,264
OST_VibrationIsolators | -2,006,265
OST_VibrationIsolatorTags | -2,006,266
OST_ExpansionJoints | -2,006,271
OST_ExpansionJointHiddenLines | -2,006,272
OST_ExpansionJointTags | -2,006,273
OST_StructuralTendons | -2,006,274
OST_StructuralTendonHiddenLines | -2,006,275
OST_StructuralTendonTags | -2,006,276
OST_BridgeFramingCrossBracingTags | -2,006,278
OST_BridgeFramingDiaphragmTags | -2,006,279
OST_BridgeFramingTrussTags | -2,006,281
OST_VibrationManagementTags | -2,006,282
OST_ConnectorElem | -2,007,000
OST_ConnectorElemXAxis | -2,007,001
OST_ConnectorElemYAxis | -2,007,002
OST_ConnectorElemZAxis | -2,007,003
OST_DuctColorFillLegends | -2,007,004
OST_DuctCurves | -2,008,000
OST_DuctCurvesCenterLine | -2,008,001
OST_DuctCurvesContour | -2,008,002
OST_DuctTags | -2,008,003
OST_FlexDuctTags | -2,008,004
OST_DuctColorFills | -2,008,005
OST_DuctFitting | -2,008,010
OST_DuctTerminal | -2,008,013
OST_DuctTerminalTags | -2,008,014
OST_DuctSystem | -2,008,015
OST_DuctAccessory | -2,008,016
OST_DuctAccessoryTags | -2,008,017
OST_FlexDuctCurves | -2,008,020
OST_FlexDuctCurvesCenterLine | -2,008,021
OST_FlexDuctCurvesContour | -2,008,022
OST_FlexDuctCurvesPattern | -2,008,023
OST_DuctCurvesRiseDrop | -2,008,036
OST_ElectricalCircuit | -2,008,037
OST_ElectricalCircuitTags | -2,008,038
OST_Wire | -2,008,039
OST_ElectricalVoltage | -2,008,040
OST_ElecDistributionSys | -2,008,041
OST_ElectricalDemandFactor | -2,008,042
OST_PipingSystem | -2,008,043
OST_PipeCurves | -2,008,044
OST_PipeCurvesCenterLine | -2,008,045
OST_PipeCurvesContour | -2,008,046
OST_PipeTags | -2,008,047
OST_FlexPipeTags | -2,008,048
OST_PipeFitting | -2,008,049
OST_FlexPipeCurves | -2,008,050
OST_FlexPipeCurvesCenterLine | -2,008,051
OST_FlexPipeCurvesContour | -2,008,052
OST_FlexPipeCurvesPattern | -2,008,053
OST_PipeCurvesRiseDrop | -2,008,054
OST_PipeAccessory | -2,008,055
OST_PipeAccessoryTags | -2,008,056
OST_WireTags | -2,008,057
OST_PipeColorFillLegends | -2,008,058
OST_PipeColorFills | -2,008,059
OST_PipeFittingTags | -2,008,060
OST_DuctFittingTags | -2,008,061
OST_DuctCurvesDrop | -2,008,062
OST_DuctCurvesInsulation | -2,008,063
OST_DuctCurvesLining | -2,008,064
OST_FlexDuctCurvesInsulation | -2,008,065
OST_DuctFittingCenterLine | -2,008,066
OST_DuctFittingInsulation | -2,008,067
OST_DuctFittingLining | -2,008,068
OST_PipeCurvesDrop | -2,008,069
OST_PipeCurvesInsulation | -2,008,070
OST_FlexPipeCurvesInsulation | -2,008,071
OST_PipeFittingCenterLine | -2,008,072
OST_PipeFittingInsulation | -2,008,073
OST_WireTickMarks | -2,008,074
OST_TelephoneDevices | -2,008,075
OST_TelephoneDeviceTags | -2,008,076
OST_NurseCallDevices | -2,008,077
OST_NurseCallDeviceTags | -2,008,078
OST_SecurityDevices | -2,008,079
OST_SecurityDeviceTags | -2,008,080
OST_CommunicationDevices | -2,008,081
OST_CommunicationDeviceTags | -2,008,082
OST_DataDevices | -2,008,083
OST_DataDeviceTags | -2,008,084
OST_FireAlarmDevices | -2,008,085
OST_FireAlarmDeviceTags | -2,008,086
OST_LightingDevices | -2,008,087
OST_LightingDeviceTags | -2,008,088
OST_WireHomeRunArrows | -2,008,089
OST_GbXMLFaces | -2,008,090
OST_GbXML_SType_Interior | -2,008,091
OST_GbXML_SType_Exterior | -2,008,092
OST_GbXML_SType_Shade | -2,008,093
OST_GbXML_SType_Underground | -2,008,094
OST_GbXML_Opening | -2,008,095
OST_RouteCurve | -2,008,096
OST_RouteCurveMain | -2,008,097
OST_RouteCurveBranch | -2,008,098
OST_Sprinklers | -2,008,099
OST_SprinklerTags | -2,008,100
OST_SwitchSystem | -2,008,101
OST_EAConstructions | -2,008,102
OST_PipeConnections | -2,008,103
OST_PipeMaterials | -2,008,104
OST_PipeSchedules | -2,008,105
OST_Fluids | -2,008,106
OST_HVAC_Zones | -2,008,107
OST_HVAC_Zones_Boundary | -2,008,108
OST_HVAC_Zones_InteriorFill | -2,008,109
OST_HVAC_Zones_Reference | -2,008,110
OST_WireMaterials | -2,008,111
OST_WireInsulations | -2,008,112
OST_WireTemperatureRatings | -2,008,113
OST_LayoutPath_Bases | -2,008,114
OST_ZoneTags | -2,008,115
OST_HVAC_Zones_ColorFill | -2,008,116
OST_HVAC_Zones_InteriorFill_Visibility | -2,008,117
OST_HVAC_Zones_Reference_Visibility | -2,008,118
OST_HVAC_Load_Space_Types | -2,008,119
OST_HVAC_Load_Building_Types | -2,008,120
OST_HVAC_Load_Schedules | -2,008,121
OST_PipeInsulations | -2,008,122
OST_DuctInsulations | -2,008,123
OST_DuctLinings | -2,008,124
OST_RoutingPreferences | -2,008,125
OST_CableTrayFitting | -2,008,126
OST_CableTrayFittingTags | -2,008,127
OST_ConduitFitting | -2,008,128
OST_ConduitFittingTags | -2,008,129
OST_CableTray | -2,008,130
OST_CableTrayTags | -2,008,131
OST_Conduit | -2,008,132
OST_ConduitTags | -2,008,133
OST_CableTrayRiseDrop | -2,008,134
OST_CableTrayDrop | -2,008,135
OST_CableTrayCenterLine | -2,008,136
OST_ConduitRiseDrop | -2,008,137
OST_ConduitDrop | -2,008,138
OST_ConduitCenterLine | -2,008,139
OST_CableTrayFittingCenterLine | -2,008,140
OST_ConduitFittingCenterLine | -2,008,141
OST_ElectricalDemandFactorDefinitions | -2,008,142
OST_ElectricalLoadClassifications | -2,008,143
OST_ConduitStandards | -2,008,144
OST_BranchPanelScheduleTemplates | -2,008,145
OST_SwitchboardScheduleTemplates | -2,008,146
OST_DataPanelScheduleTemplates | -2,008,147
OST_ParamElemElectricalLoadClassification | -2,008,148
OST_ConduitRun | -2,008,149
OST_CableTrayRun | -2,008,150
OST_PanelScheduleGraphics | -2,008,151
OST_ElectricalInternalCircuits | -2,008,152
OST_DuctInsulationsTags | -2,008,153
OST_DuctLiningsTags | -2,008,154
OST_PipeInsulationsTags | -2,008,155
OST_DuctSystem_Reference | -2,008,156
OST_DuctSystem_Reference_Visibility | -2,008,157
OST_PipingSystem_Reference | -2,008,158
OST_PipingSystem_Reference_Visibility | -2,008,159
OST_PlaceHolderDucts | -2,008,160
OST_PlaceHolderPipes | -2,008,161
OST_GraphicalWarning_OpenConnector | -2,008,162
OST_PipeSegments | -2,008,163
OST_SplitterProfile | -2,008,164
OST_DivisionProfile | -2,008,165
OST_gbXML_ExteriorWall | -2,008,167
OST_gbXML_Roof | -2,008,168
OST_gbXML_RaisedFloor | -2,008,169
OST_gbXML_SlabOnGrade | -2,008,170
OST_gbXML_InteriorWall | -2,008,171
OST_gbXML_InteriorFloor | -2,008,172
OST_gbXML_Ceiling | -2,008,173
OST_gbXML_SurfaceAir | -2,008,174
OST_gbXML_UndergroundWall | -2,008,175
OST_gbXML_UndergroundSlab | -2,008,176
OST_gbXML_UndergroundCeiling | -2,008,177
OST_gbXML_FixedWindow | -2,008,178
OST_gbXML_OperableWindow | -2,008,179
OST_gbXML_FixedSkylight | -2,008,180
OST_gbXML_OperableSkylight | -2,008,181
OST_gbXML_SlidingDoor | -2,008,182
OST_gbXML_NonSlidingDoor | -2,008,183
OST_gbXML_OpeningAir | -2,008,184
OST_AnalyticSpaces | -2,008,185
OST_AnalyticSurfaces | -2,008,186
OST_gbXML_Shade | -2,008,187
OST_DivisionRules | -2,008,190
OST_NumberingSchemas | -2,008,191
OST_LayoutPathBase_Pipings | -2,008,192
OST_FabricationDuctwork | -2,008,193
OST_FabricationDuctworkTags | -2,008,194
OST_FabricationServiceElements | -2,008,195
OST_FabricationDuctworkCenterLine | -2,008,196
OST_LayoutNodes | -2,008,197
OST_FabricationDuctworkInsulation | -2,008,198
OST_FabricationPartsTmpGraphicEnd | -2,008,199
OST_OBSOLETE_FabricationPartsTmpGraphicDrop | -2,008,200
OST_FabricationPartsTmpGraphicDrag | -2,008,201
OST_OBSOLETE_FabricationPartsTmpGraphicDropDrag | -2,008,202
OST_FabricationHangers | -2,008,203
OST_FabricationHangerTags | -2,008,204
OST_FabricationDuctworkRise | -2,008,205
OST_FabricationDuctworkDrop | -2,008,206
OST_FabricationDuctworkSymbology | -2,008,207
OST_FabricationPipework | -2,008,208
OST_FabricationPipeworkTags | -2,008,209
OST_FabricationPipeworkCenterLine | -2,008,210
OST_FabricationPipeworkSymbology | -2,008,211
OST_FabricationContainment | -2,008,212
OST_FabricationContainmentTags | -2,008,213
OST_FabricationContainmentCenterLine | -2,008,214
OST_FabricationContainmentSymbology | -2,008,215
OST_FabricationPipeworkRise | -2,008,216
OST_FabricationPipeworkDrop | -2,008,217
OST_FabricationContainmentRise | -2,008,218
OST_FabricationContainmentDrop | -2,008,219
OST_FabricationDuctworkLining | -2,008,220
OST_FabricationPipeworkInsulation | -2,008,221
OST_ELECTRICAL_AreaBasedLoads_Boundary | -2,008,222
OST_ELECTRICAL_AreaBasedLoads_InteriorFill | -2,008,223
OST_ELECTRICAL_AreaBasedLoads_Reference | -2,008,224
OST_ELECTRICAL_AreaBasedLoads_ColorFill_Obsolete | -2,008,225
OST_ELECTRICAL_AreaBasedLoads_InteriorFill_Visibility | -2,008,226
OST_ELECTRICAL_AreaBasedLoads_Reference_Visibility | -2,008,227
OST_FabricationDuctworkStiffeners | -2,008,228
OST_FabricationDuctworkStiffenerTags | -2,008,229
OST_MEPAncillaries_Obsolete | -2,008,230
OST_MEPAncillaryFraming | -2,008,231
OST_MechanicalControlDevices | -2,008,232
OST_MechanicalControlDeviceTags | -2,008,233
OST_PlumbingEquipment | -2,008,234
OST_PlumbingEquipmentTags | -2,008,235
OST_MEPAncillaryFramingTags | -2,008,236
OST_Rebar | -2,009,000
OST_RebarSketchLines | -2,009,001
OST_RebarLines | -2,009,002
OST_AreaRein | -2,009,003
OST_AreaReinSketchOverride | -2,009,004
OST_AreaReinSpanSymbol | -2,009,005
OST_AreaReinBoundary | -2,009,006
OST_AreaReinXVisibility | -2,009,007
OST_Cage | -2,009,008
OST_PathRein | -2,009,009
OST_PathReinSpanSymbol | -2,009,010
OST_PathReinTags | -2,009,011
OST_PathReinBoundary | -2,009,012
OST_RebarShape | -2,009,013
OST_CoverType | -2,009,014
OST_RebarCover | -2,009,015
OST_FabricReinforcement | -2,009,016
OST_FabricAreas | -2,009,017
OST_FabricAreaSketchEnvelopeLines | -2,009,018
OST_FabricAreaSketchSheetsLines | -2,009,019
OST_RebarTags | -2,009,020
OST_AreaReinTags | -2,009,021
OST_FabricReinforcementTags | -2,009,022
OST_FabricAreaTags | -2,009,023
OST_RebarSetToggle | -2,009,025
OST_FabricReinforcementBoundary | -2,009,026
OST_FabricReinforcementWire | -2,009,027
OST_FabricReinSpanSymbol | -2,009,028
OST_FabricAreaBoundary | -2,009,029
OST_StructConnections | -2,009,030
OST_StructWeldLines | -2,009,031
OST_StructConnectionHiddenLines | -2,009,032
OST_StructConnectionSymbol | -2,009,033
OST_StructConnectionStale | -2,009,034
OST_StructConnectionFailed | -2,009,035
OST_StructConnectionReference | -2,009,036
OST_StructConnectionProfiles | -2,009,037
OST_StructConnectionPlates | -2,009,038
OST_StructConnectionAnchors | -2,009,039
OST_StructConnectionTags | -2,009,040
OST_StructConnectionBolts | -2,009,041
OST_StructConnectionOthers | -2,009,042
OST_StructConnectionNobleWarning | -2,009,043
OST_StructConnectionShearStuds | -2,009,044
OST_StructConnectionHoles | -2,009,045
OST_StructConnectionWelds | -2,009,046
OST_StructConnectionModifiers | -2,009,047
OST_SteelElementStale | -2,009,048
OST_StructSubConnections | -2,009,049
OST_RebarHiddenLines | -2,009,050
OST_StructConnectionPlateTags | -2,009,055
OST_StructConnectionBoltTags | -2,009,056
OST_StructConnectionAnchorTags | -2,009,057
OST_StructConnectionShearStudTags | -2,009,058
OST_StructConnectionWeldTags | -2,009,059
OST_Coupler | -2,009,060
OST_CouplerTags | -2,009,061
OST_CouplerHiddenLines | -2,009,062
OST_StructConnectionHoleTags | -2,009,063
OST_StructConnectionProfilesTags | -2,009,064
OST_WindowsHiddenLines | -2,009,500
OST_DoorsHiddenLines | -2,009,501
OST_RoofsHiddenLines | -2,009,502
OST_CeilingsHiddenLines | -2,009,503
OST_LinesHiddenLines | -2,009,504
OST_FurnitureHiddenLines | -2,009,505
OST_ColumnsHiddenLines | -2,009,506
OST_StairsHiddenLines | -2,009,507
OST_StairsRailingHiddenLines | -2,009,508
OST_RampsHiddenLines | -2,009,509
OST_CurtainWallPanelsHiddenLines | -2,009,510
OST_CurtainWallMullionsHiddenLines | -2,009,511
OST_GenericModelHiddenLines | -2,009,512
OST_ShaftOpeningHiddenLines | -2,009,513
OST_DetailComponentsHiddenLines | -2,009,514
OST_CaseworkHiddenLines | -2,009,515
OST_ElectricalEquipmentHiddenLines | -2,009,516
OST_ElectricalFixturesHiddenLines | -2,009,517
OST_FurnitureSystemsHiddenLines | -2,009,518
OST_LightingFixturesHiddenLines | -2,009,519
OST_MechanicalEquipmentHiddenLines | -2,009,520
OST_PlumbingFixturesHiddenLines | -2,009,521
OST_ParkingHiddenLines | -2,009,522
OST_RoadsHiddenLines | -2,009,523
OST_SiteHiddenLines | -2,009,524
OST_StructuralFramingSystemHiddenLines_Obsolete | -2,009,525
OST_TopographyHiddenLines | -2,009,526
OST_SpecialityEquipmentHiddenLines | -2,009,527
OST_PlantingHiddenLines | -2,009,528
OST_EntourageHiddenLines | -2,009,529
OST_OBSOLETE_ElemArrayHiddenLines | -2,009,530
OST_CurtaSystemHiddenLines | -2,009,531
OST_MassHiddenLines | -2,009,532
OST_Stairs2012HiddenLines_Deprecated | -2,009,533
OST_StairRun2012HiddenLines_Deprecated | -2,009,534
OST_StairLanding2012HiddenLines_Deprecated | -2,009,535
OST_StairTread2012HiddenLines_Deprecated | -2,009,536
OST_StairStringer2012HiddenLines_Deprecated | -2,009,537
OST_RailingSystemHiddenLines_Deprecated | -2,009,538
OST_RailingSystemSegmentHiddenLines_Deprecated | -2,009,539
OST_RailingSystemPostHiddenLines_Deprecated | -2,009,540
OST_RailingSystemBalusterHiddenLines_Deprecated | -2,009,541
OST_RailingSystemPanelHiddenLines_Deprecated | -2,009,542
OST_RailingSystemPanelBracketHiddenLines_Deprecated | -2,009,543
OST_RailingSystemHandRailHiddenLines_Deprecated | -2,009,544
OST_RailingSystemHandRailBracketHiddenLines_Deprecated | -2,009,545
OST_RailingSystemTopRailHiddenLines_Deprecated | -2,009,546
OST_RailingSystemRailHiddenLines_Deprecated | -2,009,547
OST_RailingSystemTerminationHiddenLines_Deprecated | -2,009,548
OST_RailingSystemTransitionHiddenLines_Deprecated | -2,009,549
OST_MechanicalControlDevicesHiddenLines | -2,009,550
OST_PlumbingEquipmentHiddenLines | -2,009,551
OST_Truss | -2,009,600
OST_TrussDiagWebCurve | -2,009,601
OST_TrussVertWebCurve | -2,009,602
OST_TrussTopChordCurve | -2,009,603
OST_TrussBottomChordCurve | -2,009,604
OST_TrussWeb | -2,009,605
OST_TrussChord | -2,009,606
OST_StructuralTrussHiddenLines | -2,009,607
OST_StructuralTrussStickSymbols | -2,009,608
OST_SunStudy | -2,009,609
OST_Sun | -2,009,610
OST_SunPath1 | -2,009,611
OST_SunPath2 | -2,009,612
OST_CompassInner | -2,009,613
OST_SunriseText | -2,009,614
OST_CompassOuter | -2,009,615
OST_CompassSection | -2,009,616
OST_SunsetText | -2,009,617
OST_Analemma | -2,009,618
OST_SunSurface | -2,009,619
OST_MultiSurface | -2,009,620
OST_LightLine | -2,009,621
OST_CompassSectionFilled | -2,009,622
OST_CompassPrimaryMonth | -2,009,623
OST_CompassSecondaryMonth | -2,009,624
OST_BeamAnalytical | -2,009,630
OST_BeamStartSegment | -2,009,631
OST_BeamEndSegment | -2,009,632
OST_BraceAnalytical | -2,009,633
OST_BraceStartSegment | -2,009,634
OST_BraceEndSegment | -2,009,635
OST_ColumnAnalytical | -2,009,636
OST_ColumnStartSegment | -2,009,637
OST_ColumnEndSegment | -2,009,638
OST_FloorAnalytical | -2,009,639
OST_WallAnalytical | -2,009,640
OST_IsolatedFoundationAnalytical | -2,009,641
OST_WallFoundationAnalytical | -2,009,642
OST_FoundationSlabAnalytical | -2,009,643
OST_RigidLinksAnalytical | -2,009,644
OST_AnalyticalNodes | -2,009,645
OST_AnalyticalNodes_Points | -2,009,646
OST_AnalyticalNodes_Planes | -2,009,647
OST_AnalyticalNodes_Lines | -2,009,648
OST_BeamAnalyticalTags | -2,009,649
OST_BraceAnalyticalTags | -2,009,650
OST_ColumnAnalyticalTags | -2,009,651
OST_FloorAnalyticalTags | -2,009,652
OST_WallAnalyticalTags | -2,009,653
OST_IsolatedFoundationAnalyticalTags | -2,009,654
OST_WallFoundationAnalyticalTags | -2,009,655
OST_FoundationSlabAnalyticalTags | -2,009,656
OST_LinksAnalytical | -2,009,657
OST_AssemblyOrigin | -2,009,658
OST_AssemblyOrigin_Points | -2,009,659
OST_AssemblyOrigin_Planes | -2,009,660
OST_AssemblyOrigin_Lines | -2,009,661
OST_AnalyticalMember | -2,009,662
OST_AnalyticalMemberTags | -2,009,663
OST_AnalyticalPanel | -2,009,664
OST_AnalyticalOpening | -2,009,665
OST_AnalyticalMemberLocalCoordSys | -2,009,666
OST_AnalyticalPanelLocalCoordSys | -2,009,667
OST_PointClouds | -2,010,001
OST_RemovedGridSeg_Obsolete_IdInWrongRange | -20,000,827
OST_StickSymbols_Obsolete_IdInWrongRange | -20,000,828
OST_WallRefPlanes_Obsolete_IdInWrongRange | -20,000,896
OST_Mass_Obsolete_IdInWrongRange | -20,034,000
OST_MassFloor_Obsolete_IdInWrongRange | -20,034,003
OST_MassSurface_Obsolete_IdInWrongRange | -20,034,004
OST_MassTags_Obsolete_IdInWrongRange | -20,034,005
OST_StackedWalls_Obsolete_IdInWrongRange | -20,034,100
See Also
Reference
Autodesk.Revit.DB Namespace